glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC54S016_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aes" Cversion="2.0.1" condition="device.LPC54S016_AND_driver.common">
      <description>AES Driver</description>
      <files>
        <file category="header" name="drivers/fsl_aes.h"/>
        <file category="sourceC" name="drivers/fsl_aes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.LPC54S016_AND_device.LPC54S016_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54S016" Cversion="1.0.0" condition="device.LPC54S016_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC54S016_startup_AND_driver.clock_AND_driver.common_AND_driver.emc_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="LPC54S016_startup" Cversion="1.0.0" condition="device.LPC54S016_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_LPC54S016.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54S016.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54S016_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54S016_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="LPC54S016.h"/>
        <file category="header" attr="config" name="LPC54S016_features.h"/>
        <file category="sourceC" attr="config" name="system_LPC54S016.c"/>
        <file category="header" attr="config" name="system_LPC54S016.h"/>
      </files>
    </component>
  </components>
</package>
